const articles = [
    {
        title: '第一篇博客',
        author: 'violateer',
        reviewNum: 10,
        pageViews: 20,
        content: '佟振保是上海一家老牌外国商社的高级职员。他迷恋于朋友之妻“红玫瑰”王娇蕊。在几个回合的调情下，他很顺利地获得了朋友之妻的感情。后来王娇蕊想和他结婚，但他怕毁了他自己的前程，于是他放弃了王娇蕊。接着他娶了“白玫瑰”孟烟鹂，然而孟烟鹂虽然面目娇好， 性格温和，但她不喜欢“最好的户内运动”，使得佟振保不能满足在女色上的追求，很快就厌倦了这个的贞洁妻子，开始了定期嫖娼。几年后的某一天，被他始乱终弃的女人王娇蕊，与他相遇，她已为人妻母， 正带着患牙疼的孩子去看医生，一看即知是位称职的母亲和贤良的妻子，佟振保不敢相信，因为在他的认知里王娇蕊是“放浪的” 、“娶不得”的。但更令佟振保更不敢相信的是孟烟鹂居然与裁缝私通，这个事使他的认知发生了极大的倾斜与错位。从此以后，他开始公开嫖娼、疯狂地变本加厉来砸碎妻子、砸碎自己、砸碎这个家。',
        labels: ['vue'],
        md: '/markdowns/2021-01-05/1.md',
        createdAt: '2021-01-01T12:57:48.186+00:00'
    },
    {
        title: '第二篇博客',
        author: 'violateer',
        reviewNum: 10,
        pageViews: 20,
        content: '“红玫瑰”王娇蕊出生在一个华侨家庭，为了嫁的更好自小被家人送去英国读书，但因为在外面玩，玩的名声不太好了于是就顺便的嫁给了士洪。后来她遇到了佟振保，她对佟振保付出了真的感情，希望和士洪离婚然后嫁给佟振保。但佟振保并不愿意，娇蕊在振保的眼里是没有头脑的尤物，他只是希望从她的身体上得到满足。王娇蕊即使受到了佟振保的抛弃，依然选择了和士洪离婚，来证明自己爱过。后来娇蕊与振保在电车上相遇，此时娇蕊已经成为了一个传统的女人，她嫁给一个朱姓男子，并且生了孩子，过上了平静安稳的婚姻生活。但她因为丢掉了强烈的个性，迷失了自我，并不是很幸福。',
        labels: ['react'],
        md: '/markdowns/2021-01-05/2.md',
        createdAt: '2021-01-02T12:57:48.186+00:00'
    },
    {
        title: '第三篇博客',
        author: 'violateer',
        reviewNum: 10,
        pageViews: 20,
        content: '“白玫瑰”孟烟鹂，是佟振保的妻子。她是男权文化建构下最理想不过的妻子。但她不能满足佟振保在女色上的追求，所以并没有赢得丈夫的尊重和爱怜，反而受到丈夫的打压。她在佟振保的生活里不过是一个摆设而已，她压抑着自己内心的需求，一次又一次的自我退却求得些许的安稳。但她始终得不到丈夫的同情，于是她出轨了，对象是一个卑贱的裁缝。在奸情暴露之后，她变得焦虑，非常不安，她更加卑躬屈膝地顺从丈夫，但是并没有换来丈夫的原谅，反而让自己越陷越深。她始终不能正视自己的需求，也从来不知道自己存在的价值。她只会继续顺从的生活在振保的夫权统治下，成为一枝丧失了自我意识和自由灵魂的、苍凉的“白玫瑰”',
        labels: ['vue'],
        md: '/markdowns/2021-01-05/3.md',
        createdAt: '2021-01-03T12:57:48.186+00:00'
    },
    {
        title: '第四篇博客',
        author: 'violateer',
        reviewNum: 10,
        pageViews: 20,
        content: '初恋、情人、妻子，这三个人对振保的影响是深远的，通过细腻、复杂的人际关系和心理描写，张爱玲反映的是小资阶层的生活缩影和人类对情感的需求。小说并没有对“红玫瑰”和“白玫瑰”两种类型的女人做出严格意义上的价值判断，而只是在很稀松平常的故事发展中揭示出她们自身的生存状态，叙写她们自身的情感体验，并在这些生存状态和情感体验中显现出她们在男权社会中所面临的生存困境。造成这种生存困境的根源，除了两位女主人公自身的原因，与当时的社会背景，以及男主人公心中根深蒂固的男权意识是分不开的。在当时的中国，仍然是封建文化传统根深蒂固的时代，男权意识仍然是社会的主导意识。在这种意识主导之下，女人一旦威胁到男人的权威，必定会受到惩罚，王娇蕊和孟烟鹂就是这种不公平待遇的受害者。虽然在当时，也有一部分女性也曾试图冲破传统的束缚，她们上新式洋学堂，穿新式洋装，出入各大交际场所，努力争取自己应有的权益，但性别仍然束缚着她们真正意义上的进步，就像作品中的娇蕊，勇敢追求自己的真爱，但是却也最终无法真正冲破传统的束缚，依然为传统所不容，男人们永远将他们的道德限制和人格限制强加于女人，这就使得她们总是处在生存的困境中，无论如何努力，也是徒劳。',
        labels: ['nodejs', 'vue'],
        md: '/markdowns/2021-01-05/4.md',
        createdAt: '2021-01-04T12:57:48.186+00:00'
    },
    {
        title: '第五篇博客',
        author: 'violateer',
        reviewNum: 10,
        pageViews: 20,
        content: '书写变异在英文中主要包括字母大小写的变化、特殊符号的使用等，在汉语中则常常利用汉字的字形来做文章。汉字是象形文字，汉字的结构、内涵、外延，体现了中国人对事物的认知、抽象、概括和综合，是人们对世界认知的物化。人们常常利用汉字的特点进行巧妙的构思，生动的想象，创造出很多关于汉字的趣闻。张爱玲在《红玫瑰和白玫瑰》中，体现了她深厚的文化底蕴。王娇蕊写自己的名字的时候，故意将“蕊”写得零零落落，三个心写成了三个字，说明三个心房，可以住着不同的人，说明“娇蕊”是个花心的人。但是小说并没有仅仅将“蕊”的意思的阐释停留在此平面上，而是在随后的描写中，小说对这个三个心进行了进一步的解释。娇蕊对振保: “我的心是一所公寓房子。”振保问道: “可有空的房间招租呢?”并说: “我要住单幢的。”娇蕊道: “看你有本事拆了重盖! ”并说: “你要的那所房子已经造好了。”振保写了一行字: “心居落成志喜。”这里用“空的房子”“公寓房子”“单幢”“重盖的”“造好的”“心居”等名词性词语以及“招租”“住”“拆”“要”“造”“落成”等动词，表明不同的房子类型表达了恋人之间感情的建立的过程。通过上下文关于“蕊”字的互文这种“前景化”的手法可以获得意想不到的新意，给读者以新鲜感。',
        labels: ['koa', 'vue'],
        md: '/markdowns/2021-01-05/5.md',
        createdAt: '2021-01-05T12:57:48.186+00:00'
    }
];

export default articles;